slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Functional Programming in Scala</title>
<meta name="author" content="(Bill Carlson)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/sky.css" id="theme"/>

<link rel="stylesheet" href="./reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-org7c86c8b">
<h2 id="org7c86c8b">Functional Programming</h2>

</section>
</section>
<section>
<section id="slide-orga477698">
<h2 id="orga477698">Inspiration</h2>
<p>
Or, let's face it&#x2026; copying
</p>

<p>
<a href="https://www.youtube.com/watch?v=aAtPi23nLcw">Runar Bjarnasson - Introduction to Functional Programming</a>
</p>

</section>
</section>
<section>
<section id="slide-org2f6c299">
<h2 id="org2f6c299">Who am I?</h2>
<ul>
<li>Bill Carlson</li>
<li>Innovation Developer at Cotiviti Labs</li>
<li>I get paid to write purely functional programs!</li>

</ul>

</section>
</section>
<section>
<section id="slide-org20f0aad">
<h2 id="org20f0aad">What is Functional Programming?</h2>
<p class="fragment">
Programming with Functions
</p>

</section>
<section id="slide-orgb96ec32">
<h3 id="orgb96ec32">What is a Function?</h3>
<p class="fragment">
A function <code>f: A =&gt; B</code> maps any value from one set to <b>exactly one</b> value in another set.
</p>

<p class="fragment">
<i>And nothing else</i>
</p>

</section>
<section id="slide-orgd262a4f">
<h3 id="orgd262a4f">What does that mean?</h3>
<ul class="fragment">
<li><b>Totality</b>: A function will return a single value for all values of <code>A</code>.</li>
<li><b>Determinism</b>: Every time you call a function with the same arguments, you will <i>always</i> get the same result.</li>
<li><b>Purity</b>: The result of the function is the <i>only</i> effect.</li>

</ul>

</section>
<section id="slide-orgbc881c0">
<h3 id="orgbc881c0">Referential Tranparency</h3>
<p>
You can replace all occurrences of a function call with the result of that call without changing the program. 
</p>

</section>
<section id="slide-orgf9bde5c">
<h4 id="orgf9bde5c">Example</h4>
<div class="org-src-container">

<pre><code class="scala" >val string = "some text"
val s1 = string.reverse
val s2 = string.reverse
val s3 = s1 + s2
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >val sb = new StringBuilder("some text")
val s1 = sb.reverse
val s2 = sb.reverse
val s3 = s1 append s2
</code></pre>
</div>

</section>
<section id="slide-org989770a">
<h3 id="org989770a">What about&#x2026;</h3>
<ul>
<li>Console?</li>
<li>File access?</li>
<li>Network?</li>
<li>Exceptions?</li>

</ul>

<aside class="notes">
<p>
We'll get to that&#x2026;
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgcb4af94">
<h2 id="orgcb4af94">Higher-Order Functions</h2>
</section>
<section >

<p>
Oh, boy&#x2026; live code&#x2026; 
</p>

<aside class="notes">
<p>
val isEven: Int <code>&gt; Boolean = i =&gt; i % 2 =</code> 0
def divisibleBy(k: Int): Int <code>&gt; Boolean = i -&gt; i % k =</code> 0
val isEven = divisibleBy(2)
</p>

<p>
type Predicate[A] = A =&gt; Boolean
val not[A](p: Predicate[A]): Predicate[A] = a =&gt; !p(a)
val and[A](p1: Predicate[A], p2: Predicate[A]): Predicate[A] = a =&gt; p1(a) &amp;&amp; p2(a)
val or[A](p1: Predicate[A], p2: Predicate[A]): Predicate[A] = a =&gt; p1(a) || p2(a)
</p>

<p>
val lift[A](f: (Boolean, Boolean) =&gt; Boolean): 
  (Predicate[A], Predicate[A]) =&gt; Predicate[A] = 
    (p1, p2) =&gt; a =&gt; f(p1(a), p2(a))
</p>

<p>
val and[A] = lift(_ &amp;&amp; <span class="underline">)
val or[A} = lift(</span> || _)
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orga6b62a0">
<h2 id="orga6b62a0">Data Structures</h2>
<div class="outline-text-2" id="text-orga6b62a0">
</div></section>
<section id="slide-org5b144b8">
<h3 id="org5b144b8">List</h3>
<p>
Empty List: <code>Nil</code>
</p>

<p>
Non-empty list (cons): <code>A :: List[A]</code>
</p>

</section>
<section >

<p>
To build large lists, just add to a smaller list:
</p>

<div class="org-src-container">

<pre><code class="scala" >val list1 = 2 :: 3 :: 4 :: 5 :: Nil  // List(2, 3, 4, 5)

val list2 = 1 :: list1
</code></pre>
</div>

</section>
<section id="slide-org3b95139">
<h4 id="org3b95139">It's time for more code!</h4>
<aside class="notes">
<p>
def sum(ints: List[Int]): Int =
  ints match {
    case Nil =&gt; 0
    case x :: xs =&gt; x + sum1(xs)
  }
</p>

<p>
def sum2(ints: List[Int]): Int = {
  @annotation.tailrec
  def loop(acc: Int, remaining: List[Int]): Int = 
    remaining match {
      case Nil =&gt; acc
      case x :: xs =&gt; loop(acc + x, xs)
    }
  loop(0, ints)
}
</p>

<p>
What about product?  mkString? 
</p>

<p>
Generate foldLeft (and foldRight)
</p>

<p>
Show how to implement the above using foldLeft
</p>

<p>
def sum(xs: List[Int]): Int = foldLeft(xs, 0)(_ + <span class="underline">)
def product(xs: List[Int]): Int = foldLeft(xs, 1)(</span> * <span class="underline">)
def mkString(xs: List[Int]): String = foldLeft(xs, "")(</span> + _.toString)
def reverse[A](xs: List[A]): List[A] = foldLeft(xs, List.empty[A]) { (acc, i) =&gt; i :: acc }
</p>

<p>
def map[A, B](xs: List[A])(f: A =&gt; B): List[B] = foldRight(xs, List.empty[B]) { (i, acc) =&gt; f(i) :: acc }
def mapl[A, B](xs: List[A])(f: A =&gt; B): List[B] = reverse(foldLeft(xs, List.empty[B]) { (acc, i) =&gt; f(i) :: acc })
</p>

</aside>

</section>
<section id="slide-org80e57eb">
<h3 id="org80e57eb">Option[A]</h3>
<ul>
<li><code>Some[A]</code></li>
<li><code>None</code></li>

</ul>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >def fold[A](o: Option[A], z: B)(f: A =&gt; B): B = o match {
  case Some(a) =&gt; f(a)
  case None =&gt; z
}
</code></pre>
</div>

</section>
<section id="slide-org33fef77">
<h3 id="org33fef77">Either[E, A]</h3>
<ul>
<li><code>Left[E]</code></li>
<li><code>Right[A]</code></li>

</ul>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >def fold[E, A](e: Either[E, A], z: E =&gt; B, f: A =&gt; B): B = e match {
  case Left(e) =&gt; z(e)
  case Right(a) =&gt; f(a)
}
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org4caf120">
<h2 id="org4caf120">Interpreters</h2>
<ul>
<li>Your program <i>is</i> the data structure</li>
<li>Your interpreter is the fold</li>
<li><a href="https://www.gofpatterns.com/behavioral-design-patterns/behavioral-patterns/interpreter-pattern.php">GoF Interpreter Pattern</a></li>

</ul>
<p class="fragment">
Can this be extended? 
</p>

</section>
</section>
<section>
<section id="slide-org940697c">
<h2 id="org940697c">Types</h2>
<div class="outline-text-2" id="text-org940697c">
</div></section>
<section id="slide-orgf8a9aaf">
<h3 id="orgf8a9aaf">What function is this?</h3>
<p>
<code>def ????(i: Int): Int</code>
</p>

<p class="fragment appear">
<code>def inc(i: Int) = i + 1</code>
</p>

<p class="fragment appear">
<code>def timesTwo(i: Int) = i * 2</code>
</p>

<p class="fragment appear">
<code>def abs(i: Int) = if (i &lt; 0) -i else i</code>
</p>

<p class="fragment appear">
<b>???</b>
</p>

</section>
<section >

<p>
<code>def ????[A](i: A): A</code>
</p>

<p class="fragment">
<code>def identity[A](i: A): A = i</code>
</p>

<aside class="notes">
<p>
Only true in the case of purity. Otherwise, it could also do something like: 
</p>

<p>
def bar[A](i: A) = i.asInstanceOf[Int] + 1
</p>

<p>
or 
</p>

<p>
def bar[A}(i: A) = throw new RuntimeException("BWAHAHAHAHA!")
</p>

</aside>

</section>
<section >

<p>
[T]he purpose of abstracting is not to be vague, but to create a new semantic level in which one can be absolutely precise. 
</p>

<p>
&#x2013; Edsger W. Dijkstra, "The Humble Programmer"
</p>

</section>
</section>
<section>
<section id="slide-orgf8665d5">
<h2 id="orgf8665d5">Algebras</h2>
<div class="outline-text-2" id="text-orgf8665d5">
</div></section>
<section id="slide-org159ace1">
<h3 id="org159ace1">What about&#x2026;</h3>
<ul>
<li>Console?</li>
<li>File access?</li>
<li>Network?</li>
<li>Exceptions?</li>

</ul>

<aside class="notes">
<p>
Remember this slide? 
</p>

</aside>

</section>
<section id="slide-org2a2d482">
<h4 id="org2a2d482">Console</h4>
<div class="org-src-container">

<pre><code class="scala" >sealed trait Console[A]
case class Print(s: String) extends Console[Unit]
case object Read extends Console[Option[String]]
</code></pre>
</div>

</section>
<section id="slide-orgaf475f6">
<h4 id="orgaf475f6">File</h4>
<div class="org-src-container">

<pre><code class="scala" >sealed trait File[A]
case class Open(p: Path) extends File[Unit]
case class Write(data: Array[Byte]) extends File[Unit]
case object Read extends File[Array[Byte]]
case object Truncate extends File[Unit]
</code></pre>
</div>


</section>
<section id="slide-org66ef092">
<h4 id="org66ef092">And so on&#x2026;</h4>
<p>
An <i>algebra</i> is an abstract set of operations
</p>

<p>
Provides <i>laws</i> which must hold true
</p>

<p>
Using algebras, combinators, and folds, we simplify (evaluate) the program to a single value.
</p>

<p class="fragment">
&#x2026;maybe a good topic for next time? 
</p>

</section>
</section>
<section>
<section id="slide-org09a67f5">
<h2 id="org09a67f5">?</h2>

</section>
</section>
<section>
<section id="slide-org9427187">
<h2 id="org9427187">Thank you!</h2>
<p>
Bill Carlson
</p>

<p>
<a href="mailto:bill@coacoas.net">bill@coacoas.net</a>
</p>

<p>
<a href="https://twitter.com/coacoas">Twitter: @coacoas</a>
</p>

<p>
<a href="https://github.com/coacoas"><a href="https://github.com/coacoas">https://github.com/coacoas</a></a>
</p>
</section>
</section>
</div>
</div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'slide', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
